grevaillot/svd_tools/headers/STM32H750x/gpioe.h
/** @defgroup gpioe_gpio_ospeedr GPIOOSPEEDR GPIO port output speed register
@{*/


#define GPIOE_GPIO_OSPEEDR_OSPEED15_SHIFT		30
#define GPIOE_GPIO_OSPEEDR_OSPEED15_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed15 OSPEED15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED14_SHIFT		28
#define GPIOE_GPIO_OSPEEDR_OSPEED14_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed14 OSPEED14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED13_SHIFT		26
#define GPIOE_GPIO_OSPEEDR_OSPEED13_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed13 OSPEED13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED12_SHIFT		24
#define GPIOE_GPIO_OSPEEDR_OSPEED12_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed12 OSPEED12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED11_SHIFT		22
#define GPIOE_GPIO_OSPEEDR_OSPEED11_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed11 OSPEED11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED10_SHIFT		20
#define GPIOE_GPIO_OSPEEDR_OSPEED10_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed10 OSPEED10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED9_SHIFT		18
#define GPIOE_GPIO_OSPEEDR_OSPEED9_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed9 OSPEED9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED8_SHIFT		16
#define GPIOE_GPIO_OSPEEDR_OSPEED8_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed8 OSPEED8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED7_SHIFT		14
#define GPIOE_GPIO_OSPEEDR_OSPEED7_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed7 OSPEED7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED6_SHIFT		12
#define GPIOE_GPIO_OSPEEDR_OSPEED6_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed6 OSPEED6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED5_SHIFT		10
#define GPIOE_GPIO_OSPEEDR_OSPEED5_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed5 OSPEED5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED4_SHIFT		8
#define GPIOE_GPIO_OSPEEDR_OSPEED4_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed4 OSPEED4 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED3_SHIFT		6
#define GPIOE_GPIO_OSPEEDR_OSPEED3_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed3 OSPEED3 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED2_SHIFT		4
#define GPIOE_GPIO_OSPEEDR_OSPEED2_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed2 OSPEED2 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED1_SHIFT		2
#define GPIOE_GPIO_OSPEEDR_OSPEED1_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed1 OSPEED1 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


#define GPIOE_GPIO_OSPEEDR_OSPEED0_SHIFT		0
#define GPIOE_GPIO_OSPEEDR_OSPEED0_MASK		0x03
/** @defgroup gpioe_gpio_ospeedr_ospeed0 OSPEED0 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O output speed. Note: Refer to the device datasheet for the frequency specifications and the power supply and load conditions for each speed.
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioe_gpio_pupdr GPIOPUPDR GPIO port pull-up/pull-down register
@{*/


#define GPIOE_GPIO_PUPDR_PUPD15_SHIFT		30
#define GPIOE_GPIO_PUPDR_PUPD15_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd15 PUPD15 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD14_SHIFT		28
#define GPIOE_GPIO_PUPDR_PUPD14_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd14 PUPD14 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD13_SHIFT		26
#define GPIOE_GPIO_PUPDR_PUPD13_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd13 PUPD13 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD12_SHIFT		24
#define GPIOE_GPIO_PUPDR_PUPD12_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd12 PUPD12 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD11_SHIFT		22
#define GPIOE_GPIO_PUPDR_PUPD11_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd11 PUPD11 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD10_SHIFT		20
#define GPIOE_GPIO_PUPDR_PUPD10_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd10 PUPD10 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD9_SHIFT		18
#define GPIOE_GPIO_PUPDR_PUPD9_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd9 PUPD9 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD8_SHIFT		16
#define GPIOE_GPIO_PUPDR_PUPD8_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd8 PUPD8 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD7_SHIFT		14
#define GPIOE_GPIO_PUPDR_PUPD7_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd7 PUPD7 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD6_SHIFT		12
#define GPIOE_GPIO_PUPDR_PUPD6_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd6 PUPD6 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


#define GPIOE_GPIO_PUPDR_PUPD5_SHIFT		10
#define GPIOE_GPIO_PUPDR_PUPD5_MASK		0x03
/** @defgroup gpioe_gpio_pupdr_pupd5 PUPD5 [1:0]: Port x configuration bits (y = 0..15) These bits are written by software to configure the I/O pull-up or pull-down
@{*/
/**@}*/


